# CeilingAttrDefaultHeightParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CeilingAttrDefaultHeightParam Property
ParameterTypeId Class See Also
---
"Default Height above level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CeilingAttrDefaultHeightParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CeilingAttrDefaultHeightParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CeilingAttrDefaultHeightParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace